In [1]:
import pandas as pd

In [2]:
data = [['Jorge', 23], ['Marco', 25]]

df = pd.DataFrame(data, columns=['Nombre', 'Edad'])

df

  Nombre  Edad
0  Jorge    23
1  Marco    25

In [3]:
data = {
    'Nombre': ['Jorge', 'Carlos'],
    'Edad': [23, 25]
}

df = pd.DataFrame(data)

df

   Nombre  Edad
0   Jorge    23
1  Carlos    25

In [5]:
df = pd.read_csv('data/data.csv')

df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [6]:
df = pd.read_csv('data/data')

df

   nombre|edad|ciudad
0        Juan||Madrid
1  María|30|Barcelona
2    Pedro|35|Sevilla

In [7]:
df = pd.read_csv('data/data', sep='|')

df

  nombre  edad     ciudad
0   Juan   NaN     Madrid
1  María  30.0  Barcelona
2  Pedro  35.0    Sevilla

In [8]:
df = pd.read_csv('data/data_without_header')

df

    Juan  25     Madrid
0  María  30  Barcelona
1  Pedro  35    Sevilla

In [9]:
df = pd.read_csv('data/data_without_header', header=None, names=['Nombre', 'Edad', 'Ciudad'])

df

  Nombre  Edad     Ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [10]:
df = pd.read_json('data/data.json')

df

  nombre  edad     ciudad
0   Juan    25     Madrid
1  María    30  Barcelona
2  Pedro    35    Sevilla

In [11]:
df[['nombre', 'edad']]

  nombre  edad
0   Juan    25
1  María    30
2  Pedro    35

In [12]:
df.loc[2]

nombre      Pedro
edad           35
ciudad    Sevilla
Name: 2, dtype: object

In [14]:
df.loc[[0, 2]]

  nombre  edad   ciudad
0   Juan    25   Madrid
2  Pedro    35  Sevilla

In [16]:
df[ df['edad'] > 25 ]

  nombre  edad     ciudad
1  María    30  Barcelona
2  Pedro    35    Sevilla